examples/Axisymmetric/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 50.0e-6; // Free droplet radius (m)

vertices
(
    (0 0 0)
    (3.5 0 0)
    (3.5 5 0)
    (0 5 0)
    (0 0 3.5)
    (3.5 0 3.5)
    (3.5 5 3.5)
    (0 5 3.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 50 35) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    external.top
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }

    substrate
    {
        type patch;
        faces
        (
            (4 5 1 0)
        );
    }

    external.front
    {
        type patch;
        faces
        (
            (5 4 7 6)
        );
    }

    internal.back
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)
        );
    }

    internal.left
    {
        type symmetryPlane;
        faces
        (
            (4 0 3 7)
        );
    }

    external.right
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
