examples/Axisymmetric/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

// How often to refine
refineInterval  2;

refinementRegions
{
    bulk
    {
        // Field to be refinement on
        field           alpha.drop;

        // Refine field in between lower..upper
        lowerRefineLevel 1e-7;
        upperRefineLevel 2;

        // Refine cells only up to maxRefinement levels
        maxRefinement   3;

        // If value < unrefineLevel unrefine
        unrefineLevel   1e-7;
    }

    externalInterface
    {
        // Field to be refinement on
        field           alphaGradMag;

        // Refine field in between lower..upper
        lowerRefineLevel 1e2;
        upperRefineLevel 1e10;

        // Refine cells only up to maxRefinement levels
        maxRefinement   3;

        // If value < unrefineLevel unrefine
        unrefineLevel   10;
    }

}

nBufferLayers    2;           // smooth cell size transitions

maxCells         6000000;     // stop refinement if maxCells is reached

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.

    correctFluxes
    (
        (phi none)
        (nHatf none)
        (rhoPhi none)
        (alphaPhi0.drop none)
	(betaPhi none)
        //(alphaPhiUn none)
        (ghf none)
    );

    dumpLevel       true;         // write refinement level as a volScalarField
}

// ************************************************************************* //
