examples/Axisymmetric/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (drop outer);

// fluid	        glycerol-water mixture
// source		Castrejon-Pita et al (2013) Physcial Review E
// temperature		23.5 \pm 0.2  deg

drop
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-5;  // mu = 10 mPas
    rho             [1 -3 0 0 0 0 0] 1000;
}

// fluid                Air
// source               Engineering toolbox (simplified)
// temperature          23 degC

outer
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.5e-5;  // mu = 1.8e-5 Pas
    rho             [1 -3 0 0 0 0 0] 1.2;
}

// source           fluids_us.pdf
// notes            Air-Silicon oil
sigma               sigma [1 0 -2 0 0 0 0] 45.0e-3;

// ************************************************************************* //
