examples/Axisymmetric/0.orig/gamma.drop
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gamma.drop;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    substrate
    {
        type 		zeroGradient;
    }

    "internal.*"
    {
        type            symmetryPlane;
    }

    "external.*"
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
