examples/Axisymmetric/system/interfaceData
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. A specified number of graph points are used, distributed
    uniformly along the line.

start           <point>;
end             <point>;
nPoints         <number>;

fields          (<fieldNames>);

axis            distance; // The independent variable of the graph. Can be "x",
                          // "y", "z", "xyz" (all coordinates written out), or
                          // "distance" (from the start point).

\*---------------------------------------------------------------------------*/

type                sets;
libs                ("libsampling.so");

fields              (alpha.drop beta);
writeControl        writeTime;
interpolationScheme cellPoint;
setFormat           raw;

sets
(
    SubstrateData
    {
        type            lineUniform;
        axis            xyz;
        start           (0 0 0);
        end             (1.75e-4 0 0);
        nPoints         1000;
    }

    HeightData
    {
        type            lineUniform;
        axis            xyz;
        start           (0 0 0);
        end             (0 2.5e-4 0);
        nPoints         1250;
    }

);


// ************************************************************************* //
