examples/Axisymmetric/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.drop       0
    volScalarFieldValue gamma.drop       0
    volVectorFieldValue U             (0 0 0)
);

regions
(
    // Free Droplet
    sphereToCell
    {
        centre    (0 1.21e-4 0);
        radius    50e-6;
        fieldValues
        (
            volVectorFieldValue    U            (0 -5 0)
            volScalarFieldValue    alpha.drop       1
            volScalarFieldValue    beta             1
            volScalarFieldValue    gamma.drop       1
        );
    }

    // Sessile Droplet
    sphereToCell
    {
        centre    (0 -4.93971e-5 0);
        radius    9.50824e-5;
        fieldValues
        (
            volScalarFieldValue    alpha.drop  1
            volScalarFieldValue    beta        0
        );
    }
);

// ************************************************************************* //
